<p> Задача 1 Вариант 1 Выполнил Степанян С.А ПИ-321:
<p>
<?php
$a = rand(-20,20);
$c = rand(-20,20);
$d = rand(-20,20);
if ($a == 4){ 		// проверка на деление на 0
  echo "ошибка";
} else{
$b = (2*$c-$d)/(($a/4)-1);
if($d<0){                   //если $d отрицательное, меняет передний знак на +
echo '(2*' .  $c . '+' . abs($d) . ')/((' . $a . '/4)-1)<br/>';
} else{
echo '(2*' .  $c . '-' . $d . ')/((' . $a . '/4)-1)<br/>';
}
echo 'ответ =' . round($b);
}
?>
<p> Задача 1 Вариант 6 Выполнил Степанян С.А ПИ-321:
<p>
<?php
$a = rand(-20,20);
$c = rand(-20,20);
$d = rand(-20,20);
$del=($c+$a-1);
if ($del == 0){
	echo "ошибка";
} else{
	$perem = (2*$c-42*$d)/($c+$a-1);
	echo '(2*' . $c . '-42*' . $d . ') / ('. $c . '+' . $a . '- 1)<br/>';
	echo 'Результат:' . round($perem);
}
?>
